In [1]:
#con la almohadilla pondre comentarios
#las variables con objetos que se almacenan en ram
#como asignar un valor a una variable
x=2
y=3
#print sirve para ver el resultado del output
print(x+y)

5

In [2]:
x=5
print("El valor de X es "+ x)

<class 'TypeError'>: can only concatenate str (not "int") to str

In [ ]:
#aprender la funcion str, convierte numeros en texto

In [3]:
x=5
print("El valor de X es "+ str(x))

El valor de X es 5

In [4]:
#Python es un lenguaje de programacion tipado
#distingue mayusculas de minusculas
X=6
print(x+X)

11

In [5]:
#como modificar el valor de una variable existente
#por ejemplo un contador
X= X+1
print(X)

7

In [6]:
#Variables de texto, se deben asignar entre comillas
q= "hola"
print(q)

hola

In [7]:
w= "Adios"
print(q+w)

holaAdios

In [8]:
print (q+" "+w)

hola Adios

In [9]:
#Las listas en python
lista_compra = ["pan","leche","fruta","cerveza", "vodka","fanta naranja"]
lista_compra

['pan', 'leche', 'fruta', 'cerveza', 'vodka', 'fanta naranja']

In [10]:
#como acceder a un elemento de la lista, con el corchete + su indice
lista_compra[1]

'leche'

In [11]:
#las listas empiezan por el indice 0
lista_compra[3]

'cerveza'

In [12]:
#como Ã±adir un elemento a una lista con append()
lista_compra.append("macarrones")

In [13]:
lista_compra

['pan', 'leche', 'fruta', 'cerveza', 'vodka', 'fanta naranja', 'macarrones']

In [14]:
#como saber cuantos elementos tiene una lista, con la funcion len
len(lista_compra)

7

In [16]:

lista_compra.append("fruta")
lista_compra

['pan',
 'leche',
 'fruta',
 'cerveza',
 'vodka',
 'fanta naranja',
 'macarrones',
 'fruta',
 'fruta']

In [17]:
#la funcion count para contar cuantas veces se repite un elemnto
lista_compra.count("fruta")

3

In [18]:
#como insertamos un elemento a una lista, con insert
#primero la posicion donde lo queremos insertar y despues el elemento
lista_compra.insert(3,"mayonesa")

In [19]:
lista_compra

['pan',
 'leche',
 'fruta',
 'mayonesa',
 'cerveza',
 'vodka',
 'fanta naranja',
 'macarrones',
 'fruta',
 'fruta']

In [20]:
#como eliminar un elemento de la lista con remove
lista_compra.remove("fruta")
lista_compra

['pan',
 'leche',
 'mayonesa',
 'cerveza',
 'vodka',
 'fanta naranja',
 'macarrones',
 'fruta',
 'fruta']

In [21]:
#unalista numerica y vamos a aprender range
range(10)

range(0, 10)

In [22]:
lista=range(10)
lista

range(0, 10)

In [23]:
list(range(10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [24]:
#vamos a generan que vayan de 2 en 2, con range normal va de 11, se incrementa 1
lista3=range(0,20,2)#se incrementa de 2 en 2
list(lista3)

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]

In [27]:
lista4=range(5,50,3)
list(lista4)

[5, 8, 11, 14, 17, 20, 23, 26, 29, 32, 35, 38, 41, 44, 47]

In [29]:
lista5=range(50,5,-3)
list(lista5)

[50, 47, 44, 41, 38, 35, 32, 29, 26, 23, 20, 17, 14, 11, 8]

In [31]:
#funciones de resumen de una lista numerica
lista6=[50,24,33,19,28]
lista6

[50, 24, 33, 19, 28]

In [32]:
#para sumar la funcion sum
sum(lista6)

154

In [33]:
#para ver el valor mas grande con max y el mas pequelo con min
print(max(lista6))

print(min(lista6))

50
19

In [34]:
print(len(lista6))

5

In [35]:
#funciones d texto interesantes
lista7=("esto es una lista de valores")
lista8 = lista7.split()

In [36]:
print(lista8)

['esto', 'es', 'una', 'lista', 'de', 'valores']

In [37]:
len(lista8)

6

In [38]:
#El replace, para remplazar un valor con otro
lista7

'esto es una lista de valores'

In [40]:
lista9 = lista7.replace("lista","Diccionario")
lista9

'esto es una Diccionario de valores'

In [41]:
#como ver los valores en mayusculas con upper()
lista9.upper()

'ESTO ES UNA DICCIONARIO DE VALORES'

In [42]:
#como verlo en minusculas con lower
lista9.lower()

'esto es una diccionario de valores'

In [43]:
#en el navegador yupyter notebook ya tiene unas librerias
#la mas conocida es la libreria pandas, sirve para manipular datos
#primero tenemos que instalar en nuestro PC
#para trabajar con una libreria primero la tenemos que llamar o importar
import pandas as pd

In [44]:
#una serie de pandas, es una estructura de una dimension, son homogeneas deben ser del mismo tipo,(numero,fecha,texto)
s=pd.Series(data=lista_compra)
print(s)

0              pan
1            leche
2         mayonesa
3          cerveza
4            vodka
5    fanta naranja
6       macarrones
7            fruta
8            fruta
dtype: object

In [46]:
#como accedemos a una serie de pandas , igual que una lista con los corchetes
s[2]

'mayonesa'

In [47]:
#Practica 1, en una lista normal de python, asignar valores 0 y 40 en multiplos de 2
#asignar esta lista una Serie de pandas
#imprimir la serie
import pandas as pd
lista10=range(0,41,2)
H=pd.Series(data=lista10)

In [48]:
print(H)

0      0
1      2
2      4
3      6
4      8
5     10
6     12
7     14
8     16
9     18
10    20
11    22
12    24
13    26
14    28
15    30
16    32
17    34
18    36
19    38
20    40
dtype: int64

In [49]:
#funcionalidades de las series
#el numero de elementos
H.count()

21

In [50]:
#la suma de los elementos
H.sum()

420

In [51]:
#el acumulado de los valores de una serie
H.cumsum()

0       0
1       2
2       6
3      12
4      20
5      30
6      42
7      56
8      72
9      90
10    110
11    132
12    156
13    182
14    210
15    240
16    272
17    306
18    342
19    380
20    420
dtype: int64

In [52]:
#para ver el promedio con mean
H.mean()

20.0

In [53]:
print(H*2)

0      0
1      4
2      8
3     12
4     16
5     20
6     24
7     28
8     32
9     36
10    40
11    44
12    48
13    52
14    56
15    60
16    64
17    68
18    72
19    76
20    80
dtype: int64

In [54]:
# en una serie podemos ver la varianza con var(), la desviacion tipica con std()
#una serie descriptivacon describe()
H.describe()

count    21.000000
mean     20.000000
std      12.409674
min       0.000000
25%      10.000000
50%      20.000000
75%      30.000000
max      40.000000
dtype: float64

In [55]:
#como hacemos una funcion personalizada a una serie
#se realiza con def
#despues de los dos puntos tengo que hacer intro, para tabular a la derecha

def nombre_funcion(x):
    print(x+10)

In [56]:
nombre_funcion(6)

16

In [61]:
#para aplicar una funcion personalizada en una serie pandas usamos el apply
H.apply(nombre_funcion)

10
12
14
16
18
20
22
24
26
28
30
32
34
36
38
40
42
44
46
48
50

0     None
1     None
2     None
3     None
4     None
5     None
6     None
7     None
8     None
9     None
10    None
11    None
12    None
13    None
14    None
15    None
16    None
17    None
18    None
19    None
20    None
dtype: object

In [62]:
#como filtrar una serie en pandas
print(H[H>20])

11    22
12    24
13    26
14    28
15    30
16    32
17    34
18    36
19    38
20    40
dtype: int64

In [64]:
#como ordenar una serie, con sort_values(ascending=True) False = decreciente
H.sort_values(ascending=False)

20    40
19    38
18    36
17    34
16    32
15    30
14    28
13    26
12    24
11    22
10    20
9     18
8     16
7     14
6     12
5     10
4      8
3      6
2      4
1      2
0      0
dtype: int64

In [ ]:
#Practica 2 en una variable almacenar los valores siguientes 15,26,19,33,75,54
#crear una serie de pandas, ver la suma de los valores, el promedio y la desviacion tipica
#aplicar una funcion a la serie que nos multiplique el valor x3 
#ver los valores filtrados que sean mayores de 80 despues de aplicar la funcion
#ver la serie ordenada en ascendente

In [8]:
import pandas as pd
M=[15,26,19,33,75,54]


lista30=pd.Series(data=M)

In [2]:
#suma
lista30.sum()

222

In [3]:
#promedio
lista30.mean()

37.0

In [4]:
#desviacion tipica
lista30.std()

23.143033509028154

In [5]:
def multiplica3(x):
    print(x*3)

In [26]:

lista30=pd.Series(data=M)
lista30 = lista30.apply(multiplica3)

45
78
57
99
225
162

In [29]:
lista30=pd.Series(data=M)
lista30.sort_values(ascending=True)

0    15
2    19
1    26
3    33
5    54
4    75
dtype: int64

In [31]:
lista30=pd.Series(data=M)
print(lista30[lista30>30])

3    33
4    75
5    54
dtype: int64

In [94]:
def area(x,y):
    print("El area es " +str(x*y))
area(5,30)

El area es 150

In [32]:
#Los Dataframe en python es una estructura de pandas de 2 dimensiones, tiene formato de tabla,
#donde cada columna o campo es un objeto de tipo serie (datos son homogeneos)
#tendremos 2 indices por un lado el nombre de las columnas y los numeros de la filas

import pandas as pd
df = pd.DataFrame([["Maria",25,1.68],["Luis",34,1.72],["Pedro",28,1.80],["Monica",42,1.59]],columns=["Nombre","Edad","Estatura"])
print(df)

   Nombre  Edad  Estatura
0   Maria    25      1.68
1    Luis    34      1.72
2   Pedro    28      1.80
3  Monica    42      1.59

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    4 non-null      object
 1   Edad      4 non-null      int64
 2   Estatura  4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 148.0+ bytes

In [36]:
df.columns

Index(['Nombre', 'Edad', 'Estatura'], dtype='object')

In [37]:
df.size

12

In [38]:
#como ver los primeros n registros de un dataframe con head
df.head(2)

  Nombre  Edad  Estatura
0  Maria    25      1.68
1   Luis    34      1.72

In [39]:
#para ver los ultimos n registros con tail()
df.tail(1)

   Nombre  Edad  Estatura
3  Monica    42      1.59

In [41]:
#como ver solamente un campo o columna del dataframe
df["Edad"]

0    25
1    34
2    28
3    42
Name: Edad, dtype: int64

In [42]:
df["Nombre"]

0     Maria
1      Luis
2     Pedro
3    Monica
Name: Nombre, dtype: object

In [43]:
df["Edad"].max()

42

In [44]:
#la persona de menor edad
df["Edad"].min()

25

In [45]:
#Practica 3 ver el promedio de estatura
df["Estatura"].mean()

1.6975

In [49]:
#como leer un fichero con pandas y cargarlo a un dataframe
pepe=pd.read_csv("January 2019 Limpio.csv")

In [50]:
pepe

           Date   Country  Units   Revenue
0    2019-01-08       USA    343  15461.36
1    2019-01-04    Panama     93   4681.26
2    2019-01-07    Panama     42   2220.36
3    2019-01-16    Brazil    103   1853.78
4    2019-01-17       USA     28    286.30
..          ...       ...    ...       ...
184  2019-01-25       USA    337   4352.75
185  2019-01-20  Colombia    197   3256.95
186  2019-01-14    Brazil    214  12188.36
187  2019-01-12  Colombia    102   6566.51
188  2019-01-26    Panama     77   5103.71

[189 rows x 4 columns]

In [51]:
pepe

           Date   Country  Units   Revenue
0    2019-01-08       USA    343  15461.36
1    2019-01-04    Panama     93   4681.26
2    2019-01-07    Panama     42   2220.36
3    2019-01-16    Brazil    103   1853.78
4    2019-01-17       USA     28    286.30
..          ...       ...    ...       ...
184  2019-01-25       USA    337   4352.75
185  2019-01-20  Colombia    197   3256.95
186  2019-01-14    Brazil    214  12188.36
187  2019-01-12  Colombia    102   6566.51
188  2019-01-26    Panama     77   5103.71

[189 rows x 4 columns]

In [52]:
#SEGUNDO DIA DE CLASE
#asignar a un objeto el fichero csv
import pandas as pd
january = pd.read_csv("January 2019 Limpio.csv")
february = pd.read_csv("February 2019 Limpio.csv")
march = pd.read_csv("March 2019 Limpio.csv")

In [53]:
#Como hacer un Datframe consolidado, es decir con los datos de enero y febrero
#la funcion concat, un dataframe resultante entre ellos dos
#tienen que tener la misma estructura de datos
bimensual = pd.concat([january,february])

In [54]:
bimensual

           Date   Country  Units   Revenue
0    2019-01-08       USA    343  15461.36
1    2019-01-04    Panama     93   4681.26
2    2019-01-07    Panama     42   2220.36
3    2019-01-16    Brazil    103   1853.78
4    2019-01-17       USA     28    286.30
..          ...       ...    ...       ...
212  2019-02-20    Panama    115   1572.80
213  2019-02-28    Canada    243  20965.83
214  2019-02-02  Colombia     16    132.29
215  2019-02-15  Colombia    114   3767.13
216  2019-02-12    Brazil    268   3750.49

[406 rows x 4 columns]

In [ ]:
#Practica 1 
# Cargar al objeto January los valores del fichero january 2019 limpio
#Cargar al objeto febrary los valores del fichero febrary 2019 limpio
#Cargar al objeto march los valores del fichero march 2019 limpio
#en un objeto trimestre concatenar los 3 meses, ver el promedio de unidades del trimetstre, unidades mas grandes,pequeÃ±as
#ver la suma de unidades

In [55]:
trimestral = pd.concat([january,february,march])

In [57]:
#promedio
trimestral["Units"].mean()

205.80984952120383

In [58]:
#valor max
trimestral["Units"].max()

400

In [59]:
#valor min
trimestral["Units"].min()

10

In [60]:
#suma de todos los valores
trimestral["Units"].sum()

150447

In [61]:
march["Date"].sort_values(ascending=True)

162    2019-03-01
97     2019-03-01
141    2019-03-01
143    2019-03-01
145    2019-03-01
          ...
23     2019-03-31
64     2019-03-31
66     2019-03-31
21     2019-03-31
246    2019-03-31
Name: Date, Length: 325, dtype: object

In [62]:
porfecha= march.sort_values("Date",ascending=True)
porfecha

           Date   Country  Units   Revenue
162  2019-03-01    Brazil    330  16304.19
97   2019-03-01       USA    378   7383.58
141  2019-03-01    Canada    245  21329.32
143  2019-03-01    Panama    120     19.23
145  2019-03-01  Colombia     21    938.51
..          ...       ...    ...       ...
23   2019-03-31       USA    330  17351.25
64   2019-03-31    Brazil    304   2152.72
66   2019-03-31  Colombia    384   9508.81
21   2019-03-31    Canada    115   1087.99
246  2019-03-31  Colombia    329  10854.88

[325 rows x 4 columns]

In [66]:
#como ordenar la tabla , necesitamos otro objeto o variable
unidadesasc= trimestral.sort_values("Units",ascending=True)
unidadesasc.head(10)

           Date   Country  Units  Revenue
176  2019-01-20  Colombia     10   457.62
123  2019-01-03  Colombia     10   729.39
87   2019-03-06       USA     11   269.19
306  2019-03-16    Canada     11    51.43
160  2019-03-09    Brazil     12   265.21
139  2019-03-23    Canada     13   243.09
63   2019-02-06  Colombia     14   170.09
118  2019-01-04    Canada     15   309.81
36   2019-01-05    Panama     15   159.28
42   2019-01-25    Canada     15   311.34

In [67]:
#como ordenar por fecha descendente
fechadesc = trimestral.sort_values("Date", ascending= False)
fechadesc

           Date   Country  Units   Revenue
22   2019-03-31    Canada    157   4641.51
316  2019-03-31    Brazil    337   2750.29
194  2019-03-31    Canada    202   6633.31
72   2019-03-31       USA    179   1421.94
66   2019-03-31  Colombia    384   9508.81
..          ...       ...    ...       ...
67   2019-01-01       USA    295  10000.97
54   2019-01-01    Panama    293     73.34
51   2019-01-01    Brazil     86   1264.87
124  2019-01-01  Colombia    252   2309.61
128  2019-01-01    Panama    310   5679.56

[731 rows x 4 columns]

In [68]:
#Practica2
#ordenar el dataframe triemeste por contry ascendente y ver solo 6 parametros y ver solo los 6 primeros
#ordenar el dataframe triemeste por revenue descendiente y ver solo 6 parametros y ver solo los 6 primeros

In [69]:
countryasc= trimestral.sort_values("Country",ascending=True)
countryasc.head(6)

           Date Country  Units   Revenue
52   2019-02-10  Brazil    244  14009.41
266  2019-03-03  Brazil    354  26971.78
264  2019-03-19  Brazil     94   4224.30
105  2019-01-06  Brazil     55    619.87
106  2019-01-05  Brazil    383  11854.56
107  2019-01-12  Brazil    258  12418.27

In [70]:
revenueasc= trimestral.sort_values("Revenue",ascending=False)
revenueasc.head(6)

           Date   Country  Units   Revenue
177  2019-03-10    Brazil    390  36749.90
125  2019-01-25    Canada    351  34287.19
146  2019-01-14    Canada    367  31226.52
19   2019-01-03    Brazil    377  30840.25
279  2019-03-14    Panama    340  29618.13
53   2019-03-24  Colombia    370  29222.28

In [72]:
#Como filtrar registros de un dataframe
countryusa = trimestral["Country"]=="USA"
trimestreusa = trimestral[countryusa]
trimestreusa

           Date Country  Units   Revenue
0    2019-01-08     USA    343  15461.36
4    2019-01-17     USA     28    286.30
11   2019-01-25     USA     56   1650.34
18   2019-01-20     USA    296    391.86
21   2019-01-05     USA    279  12881.19
..          ...     ...    ...       ...
301  2019-03-17     USA    378   5687.77
317  2019-03-28     USA    319  10656.61
318  2019-03-08     USA    155  11919.24
320  2019-03-15     USA    246   6002.69
321  2019-03-02     USA    240   3783.21

[150 rows x 4 columns]

In [78]:
#Practica 3 
#Queremos ver la suma de revenue en panama
#Queremos ver el promedio de revenue en todos los paises sea mayor de 1000
countrypanama = trimestral["Country"]=="Panama"
countrypanama

0      False
1       True
2       True
3      False
4      False
       ...
320    False
321    False
322     True
323    False
324     True
Name: Country, Length: 731, dtype: bool

In [83]:
trimestrepanama=trimestral[countrypanama]
trimestrepanama["Revenue"].sum()

1061959.71

In [84]:
#promedio
revenueremayor1000 = trimestral["Revenue"]>1000
timestremayor1000 =trimestral[revenueremayor1000]
timestremayor1000["Revenue"].mean()

7725.457394822007

In [85]:
countrynobrazil = trimestral["Country"]!="Brazil"
timestrenobrazil =trimestral[countrynobrazil]
timestrenobrazil["Units"].max()

400

In [89]:
#la suma de units de canada + colombia, isin siginifica que esta en la lista siguiente
trimestrecancol = trimestral[trimestral.Country.isin(["Canada","Colombia"])]
trimestrecancol["Revenue"].sum()

1856670.3500000003

In [90]:
#Lo contrario que no este en la lista, ver los paises que no sean colombia o canada
#se hace con la virgulilla ~ alt + Ã± en mac en pc altgr+4 dos veces
trimestrenocancol = trimestral[~trimestral.Country.isin(["Canada","Colombia"])]
trimestrenocancol

           Date Country  Units   Revenue
0    2019-01-08     USA    343  15461.36
1    2019-01-04  Panama     93   4681.26
2    2019-01-07  Panama     42   2220.36
3    2019-01-16  Brazil    103   1853.78
4    2019-01-17     USA     28    286.30
..          ...     ...    ...       ...
320  2019-03-15     USA    246   6002.69
321  2019-03-02     USA    240   3783.21
322  2019-03-22  Panama    299   3707.41
323  2019-03-22  Brazil    120    660.37
324  2019-03-09  Panama    197  10554.67

[449 rows x 4 columns]

In [99]:
#practica
#Vamos a combinar varios filtros, ver los registros de canada mas USA cuyas units 200>
#con el operador & (Ampersand)hacemos el AND, que se tienen que cumplir las dos condiciones
trimestrecanusa = trimestral[(trimestral.Country.isin(["Canada","USA"]))
                             & (trimestral.Units>300)]
trimestrecanusa

           Date Country  Units   Revenue
0    2019-01-08     USA    343  15461.36
5    2019-01-24  Canada    372  24826.98
23   2019-01-07  Canada    306   4131.21
37   2019-01-27  Canada    389  10312.46
39   2019-01-25  Canada    371  20234.08
..          ...     ...    ...       ...
270  2019-03-16     USA    361   5685.54
274  2019-03-07  Canada    378   6530.52
282  2019-03-24     USA    340   7836.67
301  2019-03-17     USA    378   5687.77
317  2019-03-28     USA    319  10656.61

[84 rows x 4 columns]